cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/services"
tap "kong/deck"
tap "hashicorp/tap"
tap "joemiller/taps"
tap "cloudflare/cloudflare"

cask 'discord'
cask 'dropbox'
cask 'spotify'
cask 'dbeaver-community'
cask 'postman'
cask 'visual-studio-code'
cask 'vlc'
cask 'appcleaner'
cask 'raycast'
cask 'iterm2'
cask 'keepassxc'
cask 'slack'
cask 'shadow'
cask 'scroll-reverser'

brew 'asdf'
brew 'azure-cli'
brew 'tig'
brew 'pipx'
brew 'awscli'
brew 'cdk8s'
brew 'cloudflare/cloudflare/cf-terraforming'
brew 'coreutils'
brew 'colima'
brew 'chezmoi'
brew 'docker'
brew 'docker-compose'
brew 'docker-buildx'
brew 'fzf'
brew "git"
brew "git-grab"
brew "git-lfs"
brew "istioctl"
brew "zsh"
brew "vim"
brew "jq"
brew "gpg"
brew "tree"
brew "colordiff"
brew "wget"
brew "tfenv"
brew "tgenv"
brew "kind"
brew "kube-ps1"
brew "kubectl"
brew "krew"
brew "kubectx"
brew "helm"
brew "k9s"
brew "vale"
brew "cloudflared"
brew "pnpm"
brew "nvm"
brew "fluxcd/tap/flux"
brew "postgresql"
